[
    {
        "criteria": "¿Has terminado tus estudios universitarios?",
        "scores": [
            {
                "value": 4,
                "text": "Si, titulado de estudios universitarios o me encuentro en proceso de titulación"
            },
            {
                "value": 3,
                "text": "Servicio social o prácticas profesionales o sigue estudiando fuera del horario del bootcamp"
            },
            {
                "value": 2,
                "text": "Servicio social o prácticas profesionales en el mismo horario del bootcamp"
            },
            {
                "value": 1,
                "text": "Estudiando en el mismo horario del bootcamp. Tengo estudios de preparatoria"
            }
        ]
    },
    {
        "criteria": "¿Qué tipo de estudios cursaste?",
        "scores": [
            {
                "value": 4,
                "text": "Ingeniería en sistemas o TI"
            },
            {
                "value": 3,
                "text": "Otro tipo de Ingenierías (Industrial, Ambiental, Biomédica, Geofísica, Diseño, etc..)"
            },
            {
                "value": 2,
                "text": "Otra área universitaria ( Administración, Música, Letras, Psicología, etc.)"
            },
            {
                "value": 1,
                "text": "Preparatoria o bachillerato"
            }
        ]
    },
    {
        "criteria": "¿Cuál es tu nivel de inglés?",
        "scores": [
            {
                "value": 4,
                "text": "C1, C2 (Avanzado)"
            },
            {
                "value": 3,
                "text": "B1, B2 (Intermedio)"
            },
            {
                "value": 2,
                "text": "A1, A2 (Basico)"
            },
            {
                "value": 1,
                "text": "Nulo (Sin conocimientos)"
            }
        ]
    },
    {
        "criteria": "¿Cuentas ya con conocimientos técnicos en algún lenguaje?",
        "scores": [
            {
                "value": 4,
                "text": "Si, seleccionó Java, JavaScript y/o React"
            },
            {
                "value": 3,
                "text": "Si, seleccionó al menos HTML y CSS"
            },
            {
                "value": 2,
                "text": "Si, seleccionó al menos Python o muy básicos"
            },
            {
                "value": 1,
                "text": "Ninguno"
            }
        ]
    },
    {
        "criteria": "¿Cuentas con equipo de cómputo e internet sin limitaciones de tiempo, cuenta con cámara y micrófono funcionando correctamente?",
        "scores": [
            {
                "value": 4,
                "text": "Cuento con equipo de cómputo en buen estado e internet ilimitado"
            },
            {
                "value": 3,
                "text": "Mi equipo de cómputo no es tan nuevo y a veces se alenta un poco. Tengo internet sin restricción"
            },
            {
                "value": 2,
                "text": "Tengo equipo de cómputo, pero no tengo internet todo el tiempo"
            },
            {
                "value": 1,
                "text": "Tengo acceso a internet, pero no computadora ¿Podría Generation prestarme un equipo para el curso?"
            }
        ]
    },
    {
        "criteria": "¿Te comprometes a ser abiertx con las posibilidades laborales que puedas obtener?",
        "scores": [
            {
                "value": 4,
                "text": "Si, estoy abiertx a contemplar todos los esquemas de empleo. (Presencial o hibrido)"
            },
            {
                "value": 3,
                "text": "Para mí solo es posible considerar trabajos remotos o muy flexibles"
            },
            {
                "value": 2,
                "text": "No me urge emplearme al terminar, quiero seguir aprendiendo. Mi prioridad es seguir estudiando"
            },
            {
                "value": 1,
                "text": "N/A"
            }
        ]
    },
    {
        "criteria": "¿Estás llevando algún tipo de seguimiento médico o de rehabilitación?",
        "scores": [
            {
                "value": 4,
                "text": "No lleva seguimientos médicos o de rehabilitación"
            },
            {
                "value": 3,
                "text": "Lleva algún seguimiento médico o de rehabilitación que no le imposibilita"
            },
            {
                "value": 2,
                "text": "Lleva algún seguimiento médico o de rehabilitación delicado"
            },
            {
                "value": 1,
                "text": "Su tratamiento médico o de rehabilitación se complica frecuentemente"
            }
        ]
    },
    {
        "criteria": "En que ciudad/estado resides actualmente?",
        "scores": [
            {
                "value": 4,
                "text": "CDMX/EDOMEX"
            },
            {
                "value": 3,
                "text": "Merida, Monterrey, Culiacan, Guadalajara."
            },
            {
                "value": 2,
                "text": "Queretaro, Puebla, Cuernavaca, Pachuca"
            },
            {
                "value": 1,
                "text": "Otra, pero estoy dispuestx a mudarme para conseguir empleo"
            }
        ]
    }
]